package com.kh.ifEx;
/*
1. if
만약에 () 안에 작성한 조건이 true = 참 일때만 특정 코드블록을 실행하는 제어문

if (조건) {
	조건이 참일 때 실행하는 코드
}

2. if - else if - else

	if, else 는 최초 1회만 작성 가능
	
	if 는 생략불가, else if, else 는 생략 가능
	
	else if 는 만들고 싶은 조건 만큼 만들 수 있음 
	
if(조건1) {
	조건1 이 참일 때 실행되는 코드
}
else if(조건2) {
	조건1 이 거짓이고 조건2 가 참일 때 실행되는 코드
}
else {
	위 모든 조건이 거짓일 때 실행되는 코드
}
 
3. if - else
	if 의 조건이 거짓일 때 실행하고자 하는 내용이 있다면 else 를 사용해서 { } 안에 
	거짓에 대한 내용을 장성
	
	if(조건) {
		조건이 참일 때 실행되는 코드들
	}
	else {
		조건이 거짓일 때 실행되는 코드들
	}

4. 간단하게 사용하는 if else 문 (= 삼항연산자)
	(조건) ? 참이라면 주는 곳 : 거짓이라면 주는 곳
	(조건) ? true 일 때 진행할 내용 : false 일 때 진행할 내용

	If 문에서 블록안에는 System.out.print 이외 내가 작성하고 싶은 코드를 모두 작성할 수 있지만
	현재 출력문을 사용하는 방식이 우리가 익히기 편하기 때문에 System.out.print 와 같은
	출력문만 작성하는 것일 뿐이지 무조건 print 만 되는 것이 아님

 */
public class If문 {

}
